IDEA Open Model
CheckResPlate Class
Compatible with IDEA StatiCa Beta 20.0
 Check value for Plate
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.Connection.CheckResPlate
 Namespace: IdeaRS.OpenModel.Connection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
[SerializableAttribute]
public class CheckResPlate
<SerializableAttribute>
Public Class CheckResPlate
The CheckResPlate type exposes the following members.
Constructors
Name | Description
CheckResPlate
Initializes a new instance of the CheckResPlate class
Top
Properties
Name | Description
CheckStatus
 Status of the Check
Items
 In case of presentation of groups plates (uncoiled beams)
LoadCaseId
 Id of Load Case
MaxStrain
 Max Strain
MaxStress
 Max Stress
Name
 Name of Plate
Top
See Also
Reference
IdeaRS.OpenModel.Connection Namespace